# Data Type Conversions
----------
1.	Converting categorical data in to ‘category’ dtype, can make the DataFrame **smaller in memory**
2.	Numeric data loaded as a string (for example any – in data), then system will identify as object datatype.

## 1. Exercise 1: Converting object data type into Category Datatype

In [1]:
import os 
os.chdir("C:\\Users\\Hi\\Google Drive\\01 DS ML DL NLP and AI With Python Lab Copy\\02 Lab Data\\Python")

In [2]:
# 01. Import required module 
import pandas as pd
# 02. load csv as dataframe
df = pd.read_csv('tips.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null object
tip           244 non-null object
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: int64(1), object(6)
memory usage: 13.4+ KB

In [4]:
df.head()

  total_bill   tip     sex smoker  day    time  size
0      16.99  1.01  Female     No  Sun  Dinner     2
1          -     -    Male     No  Sun  Dinner     3
2      21.01   3.5    Male     No  Sun  Dinner     3
3      23.68  3.31    Male     No  Sun  Dinner     2
4      24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
# 03. Convert the sex column to type 'category'
df.sex = df.sex.astype('category')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null object
tip           244 non-null object
sex           244 non-null category
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: category(1), int64(1), object(5)
memory usage: 11.8+ KB

In [7]:
df.smoker = df.smoker.astype("category")

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null object
tip           244 non-null object
sex           244 non-null category
smoker        244 non-null category
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: category(2), int64(1), object(4)
memory usage: 10.3+ KB

## 2. Exercise 2: Converting object datatype into Number Datatype

In [9]:
df.tip = pd.to_numeric(df.tip,errors="coerce") # convert error vale as NAN

In [10]:
df.head(3)

  total_bill   tip     sex smoker  day    time  size
0      16.99  1.01  Female     No  Sun  Dinner     2
1          -   NaN    Male     No  Sun  Dinner     3
2      21.01  3.50    Male     No  Sun  Dinner     3

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null object
tip           243 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: category(2), float64(1), int64(1), object(3)
memory usage: 10.3+ KB

In [12]:
df.total_bill = pd.to_numeric(df.total_bill,errors="coerce") # convert error vale as NAN

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    243 non-null float64
tip           243 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: category(2), float64(2), int64(1), object(2)
memory usage: 10.3+ KB

In [14]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1         NaN   NaN    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3